Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# EventTrigger.Name.Unknown
source: Unknown Event
de: Unbekanntes Ereignis
ja: 不明なイベント
pt_br: Evento desconhecido
ru: Неизвестное событие
zh_hans: 未知事件

# EventTrigger.Name.UserChanged
source: User Changed
de: Benutzer geändert
ja: ユーザーの変更
pt_br: Usuário alterado
ru: Пользователь изменён
zh_hans: 用户已更改

# EventTrigger.Name.VariableChanged
source: Variable Changed
de: Variable geändert
ja: 変数の変更
pt_br: Variável alterada
ru: Переменная изменена
zh_hans: 变量已更改

# EventTrigger.NoParameters
source: No additional parameters required.
de: Keine zusätzlichen Parameter erforderlich.
ja: 追加のパラメータは不要です。
pt_br: Nenhum parâmetro adicional é necessário.
ru: Дополнительные параметры не требуются.
zh_hans: 无需其他参数。

# EventTrigger.ProgressBarFilter.Appears
source: Appears
de: Erscheint
ja: 表示
pt_br: Aparece
ru: Появляется
zh_hans: 出现

# EventTrigger.ProgressBarFilter.Disappears
source: Disappears
de: Verschwindet
ja: 非表示
pt_br: Desaparece
ru: Исчезает
zh_hans: 消失

# EventTrigger.ProgressBarFilter.Either
source: Appears or Disappears
de: Erscheint oder verschwindet
ja: 表示または非表示
pt_br: Aparece ou desaparece
ru: Появляется или исчезает
zh_hans: 出现或消失

# EventTrigger.SecondsUnit
source: seconds
de: Sekunden
ja: 秒
pt_br: segundos
ru: секунд
zh_hans: 秒

# ExpressionBindableView.BindInformativeText
source: Enter expression to bind to this setting, or leave empty to clear the binding.
de: Geben Sie den Ausdruck ein, der an diese Einstellung gebunden werden soll, oder lassen Sie das Feld leer, um die Bindung zu entfernen.
ja: この設定にバインドする式を入力してください。空欄にするとバインドが解除されます。
pt_br: Digite a expressão a vincular a este ajuste, ou deixe em branco para limpar a vinculação.
ru: Введите выражение для привязки к этой настройке или оставьте поле пустым, чтобы удалить привязку.
zh_hans: 输入要绑定到此设置的表达式，或留空以清除绑定。

# ExpressionBindableView.BindMessageText
source: Bind Expression to Setting
de: Ausdruck an Einstellung binden
ja: 設定に式をバインド
pt_br: Vincular expressão ao ajuste
ru: Привязать выражение к настройке
zh_hans: 将表达式绑定到设置

# ExpressionBindableView.BindToExpression
source: Bind to Expression
de: An Ausdruck binden
ja: 式にバインド
pt_br: Vincular a expressão
ru: Привязать к выражению
zh_hans: 绑定到表达式

# ExpressionBindableView.EditBinding
source: Edit Expression Binding
de: Ausdrucksbindung bearbeiten
ja: 式のバインドを編集
pt_br: Editar vinculação de expressão
ru: Изменить привязку выражения
zh_hans: 编辑表达式绑定

# ExpressionBindableView.ExpressionPlaceholder
source: Expression (e.g., %@)
de: Ausdruck (z. B. %@)
ja: 式（例: %@）
pt_br: Expressão (por exemplo, %@)
ru: Выражение (например, %@)
zh_hans: 表达式（例如 %@）

# ExpressionBindableView.HelpBackground
source: ### Background Binding a setting to an expression lets you change settings programmatically. iTerm2 tracks a collection of “Variables” for each session. You can learn more about them in [Scripting Fundamentals](https://iterm2.com/documentation-scripting-fundamentals.html). Typically this feature is used by binding a setting to a user-defined variable. ### Example The easiest way to set a user-defined variable is to install shell integration and then define a `iterm2_print_user_vars` function. Here's an example using bash: ``` iterm2_print_user_vars() { iterm2_set_user_var %1$@ $(echo $%2$@) } ``` This runs each time the shell prompt is printed. The example sets a user-defined variable to the value of the environment variable `%3$@`. The appropriate expression to bind this example would be `user.%4$@`. All user-defined variables go in the `user` scope. ### Debugging You can view variables in the Inspector (**Scripts > Manage > Console** and then click **Inspector**).
de: ### Hintergrund Wenn Sie eine Einstellung an einen Ausdruck binden, können Sie Einstellungen programmatisch ändern. iTerm2 verwaltet für jede Sitzung eine Sammlung von „Variablen“. Weitere Informationen dazu finden Sie unter [Scripting Fundamentals](https://iterm2.com/documentation-scripting-fundamentals.html). Üblicherweise wird diese Funktion verwendet, indem eine Einstellung an eine benutzerdefinierte Variable gebunden wird. ### Beispiel Am einfachsten legen Sie eine benutzerdefinierte Variable fest, indem Sie die Shell-Integration installieren und dann eine Funktion `iterm2_print_user_vars` definieren. Hier ist ein Beispiel mit bash: ``` iterm2_print_user_vars() { iterm2_set_user_var %1$@ $(echo $%2$@) } ``` Dies wird jedes Mal ausgeführt, wenn die Shell-Eingabeaufforderung angezeigt wird. Das Beispiel setzt eine benutzerdefinierte Variable auf den Wert der Umgebungsvariable `%3$@`. Der passende Ausdruck, um dieses Beispiel zu binden, wäre `user.%4$@`. Alle benutzerdefinierten Variablen befinden sich im Gültigkeitsbereich `user`. ### Fehlersuche Sie können Variablen im Inspector anzeigen (**Scripts > Manage > Console** und dann auf **Inspector** klicken).
ja: ### 背景 設定を式にバインドすると、プログラムから設定を変更できるようになります。 iTerm2は各セッションについて「変数」の集合を管理しています。詳しくは[スクリプティングの基礎](https://iterm2.com/documentation-scripting-fundamentals.html)をご覧ください。 通常、この機能はユーザー定義変数に設定をバインドするために使用します。 ### 例 ユーザー定義変数を設定する最も簡単な方法は、シェル統合をインストールしてから`iterm2_print_user_vars`関数を定義することです。以下はbashを使った例です。 ``` iterm2_print_user_vars() { iterm2_set_user_var %1$@ $(echo $%2$@) } ``` これはシェルのプロンプトが表示されるたびに実行されます。この例では、環境変数`%3$@`の値をユーザー定義変数に設定しています。 この例をバインドするのに適した式は`user.%4$@`です。ユーザー定義変数はすべて`user`スコープに置かれます。 ### デバッグ 変数はInspectorで確認できます（**Scripts > Manage > Console**を開き、**Inspector**をクリックします）。
pt_br: ### Contexto Vincular um ajuste a uma expressão permite alterar ajustes de forma programática. O iTerm2 rastreia um conjunto de “Variáveis” para cada sessão. Você pode saber mais sobre elas em [Fundamentos de scripting](https://iterm2.com/documentation-scripting-fundamentals.html). Normalmente este recurso é usado vinculando um ajuste a uma variável definida pelo usuário. ### Exemplo A maneira mais fácil de definir uma variável definida pelo usuário é instalar o shell integration e depois definir uma função `iterm2_print_user_vars`. Aqui está um exemplo usando bash: ``` iterm2_print_user_vars() { iterm2_set_user_var %1$@ $(echo $%2$@) } ``` Isto é executado cada vez que o prompt do shell é impresso. O exemplo define uma variável definida pelo usuário com o valor da variável de ambiente `%3$@`. A expressão apropriada para vincular este exemplo seria `user.%4$@`. Todas as variáveis definidas pelo usuário ficam no escopo `user`. ### Depuração Você pode ver as variáveis no Inspetor (**Scripts > Manage > Console** e depois clique em **Inspector**).
ru: ### Общие сведения Привязка настройки к выражению позволяет изменять настройки программно. iTerm2 отслеживает набор «Переменных» для каждого сеанса. Подробнее о них можно узнать в разделе [Основы скриптинга](https://iterm2.com/documentation-scripting-fundamentals.html). Обычно эта функция используется для привязки настройки к пользовательской переменной. ### Пример Проще всего задать пользовательскую переменную, установив интеграцию с оболочкой и определив функцию `iterm2_print_user_vars`. Вот пример для bash: ``` iterm2_print_user_vars() { iterm2_set_user_var %1$@ $(echo $%2$@) } ``` Эта функция выполняется каждый раз при выводе приглашения оболочки. В примере пользовательской переменной присваивается значение переменной окружения `%3$@`. Подходящим выражением для привязки в этом примере будет `user.%4$@`. Все пользовательские переменные находятся в области видимости `user`. ### Отладка Просмотреть переменные можно в Инспекторе (**Скрипты > Управление > Консоль**, затем нажмите **Инспектор**).
zh_hans: ### 背景 将设置绑定到表达式后，你可以通过编程方式更改设置。 iTerm2 会为每个会话跟踪一组“变量”。你可以在 [Scripting Fundamentals](https://iterm2.com/documentation-scripting-fundamentals.html) 中了解更多信息。 通常，这个功能的用法是将设置绑定到用户定义的变量。 ### 示例 设置用户定义变量最简单的方法是安装 shell integration，然后定义 `iterm2_print_user_vars` 函数。下面是一个 bash 示例： ``` iterm2_print_user_vars() { iterm2_set_user_var %1$@ $(echo $%2$@) } ``` 每次 shell 提示符输出时都会运行它。这个示例将用户定义变量设置为环境变量 `%3$@` 的值。 适合绑定到这个示例的表达式是 `user.%4$@`。所有用户定义变量都位于 `user` 作用域中。 ### 调试 你可以在检查器中查看变量（依次点按 **Scripts > Manage > Console**，然后点按 **Inspector**）。

# ExpressionBindableView.HelpForThisSetting
source: ### For This Setting %@
de: ### Für diese Einstellung %@
ja: ### この設定について %@
pt_br: ### Para este ajuste %@
ru: ### Для этой настройки %@
zh_hans: ### 此设置 %@

# ExpressionBindableView.RemoveBinding
source: Remove Expression Binding
de: Ausdrucksbindung entfernen
ja: 式のバインドを削除
pt_br: Remover vinculação de expressão
ru: Удалить привязку выражения
zh_hans: 移除表达式绑定

# ExpressionEvaluator.ErrorEvaluatingExpression
source: Error evaluating expression %1$@: %2$@
de: Fehler beim Auswerten des Ausdrucks %1$@: %2$@
ja: 式 %1$@ の評価エラー: %2$@
pt_br: Erro ao avaliar a expressão %1$@: %2$@
ru: Ошибка вычисления выражения %1$@: %2$@
zh_hans: 计算表达式 %1$@ 时出错：%2$@

# ExpressionEvaluator.InvalidExpressionType
source: Invalid parsed expression type %@
de: Ungültiger geparster Ausdruckstyp %@
ja: 無効な解析済み式の型 %@
pt_br: Tipo de expressão analisada inválido %@
ru: Недопустимый тип разобранного выражения %@
zh_hans: 解析出的表达式类型无效 %@

# ExpressionParser.ArrayIndexMustBeNumber
source: Array index for “%1$@” must be a number, not %2$@
de: Der Array-Index für „%1$@“ muss eine Zahl sein, nicht %2$@
ja: 「%1$@」の配列インデックスは数値である必要があります。%2$@ ではありません
pt_br: O índice do array para “%1$@” deve ser um número, não %2$@
ru: Индекс массива для «%1$@» должен быть числом, а не %2$@
zh_hans: “%1$@”的数组索引必须是数字，而不是 %2$@

# ExpressionParser.CantFormReference
source: Can’t form reference to non-existent or read-only container for variable %@
de: Es kann keine Referenz auf einen nicht vorhandenen oder schreibgeschützten Container für die Variable %@ gebildet werden
ja: 変数 %@ について、存在しないか読み取り専用のコンテナへの参照を作成できません
pt_br: Não é possível formar referência a um contêiner inexistente ou somente leitura para a variável %@
ru: Не удаётся создать ссылку на несуществующий или доступный только для чтения контейнер для переменной %@
zh_hans: 无法形成对不存在或只读变量容器%@的引用

# ExpressionParser.ErrorEvaluatingIndex
source: Error evaluating index expression: %@
de: Fehler beim Auswerten des Indexausdrucks: %@
ja: インデックス式の評価エラー: %@
pt_br: Erro ao avaliar a expressão de índice: %@
ru: Ошибка вычисления выражения индекса: %@
zh_hans: 评估索引表达式时出错：%@

# ExpressionParser.ExpectedFunctionCallNotInterpolatedString
source: Expected function call, not an interpolated string
de: Funktionsaufruf erwartet, kein interpolierter String
ja: 関数呼び出しが必要ですが、補間文字列が指定されました
pt_br: Esperava-se uma chamada de função, não uma string interpolada
ru: Ожидался вызов функции, а не интерполированная строка
zh_hans: 期望函数调用，而非插值字符串

# ExpressionParser.ExpectedFunctionCallNotNil
source: Expected function call, not nil
de: Funktionsaufruf erwartet, nicht nil
ja: 関数呼び出しが必要ですが、nilが指定されました
pt_br: Esperava-se uma chamada de função, não nil
ru: Ожидался вызов функции, а не nil
zh_hans: 期望函数调用，而非nil值

# ExpressionParser.ExpectedFunctionCallNotValue
source: Expected function call, not a value
de: Funktionsaufruf erwartet, kein Wert
ja: 関数呼び出しが必要ですが、値が指定されました
pt_br: Esperava-se uma chamada de função, não um valor
ru: Ожидался вызов функции, а не значение
zh_hans: 期望函数调用，而非数值

# ExpressionParser.ExpectedSingleFunctionCall
source: Expected single function call
de: Einzelner Funktionsaufruf erwartet
ja: 単一の関数呼び出しが必要です
pt_br: Esperava-se uma única chamada de função
ru: Ожидался единственный вызов функции
zh_hans: 期望单一函数调用

# ExpressionParser.IndexOutOfRange
source: Index %1$@ out of range of “%2$@”, which has %3$@ values
de: Index %1$@ liegt außerhalb des Bereichs von „%2$@“, der %3$@ Werte enthält
ja: インデックス %1$@ は「%2$@」の範囲外です（%3$@ 個の値があります）
pt_br: Índice %1$@ fora do intervalo de “%2$@”, que tem %3$@ valores
ru: Индекс %1$@ выходит за пределы «%2$@», в котором %3$@ значений
zh_hans: 索引 %1$@ 超出 “%2$@” 的范围，其值为 %3$@

# ExpressionParser.IndexOutOfRangeOneValue
source: Index %1$@ out of range of “%2$@”, which has 1 value
de: Index %1$@ liegt außerhalb des Bereichs von „%2$@“, der 1 Wert enthält
ja: インデックス %1$@ は「%2$@」の範囲外です（1個の値があります）
pt_br: Índice %1$@ fora do intervalo de “%2$@”, que tem 1 valor
ru: Индекс %1$@ выходит за пределы «%2$@», в котором 1 значение
zh_hans: 索引 %1$@ 超出 “%2$@” 的范围，其值为 1

# ExpressionParser.NullNeverAllowed
source: &null is never allowed
de: &null ist niemals zulässig
ja: &nullは許可されません
pt_br: &null nunca é permitido
ru: &null никогда не допускается
zh_hans: &null 从不允许使用

# ExpressionParser.ReferenceToUndefinedVariable
source: Reference to undefined variable “%1$@”. Change it to “%2$@?” to treat the undefined value as null.
de: Verweis auf undefinierte Variable „%1$@“. Ändern Sie sie in „%2$@?“, um den undefinierten Wert als null zu behandeln.
ja: 未定義の変数「%1$@」への参照です。未定義の値をnullとして扱うには「%2$@?」に変更してください。
pt_br: Referência à variável indefinida “%1$@”. Altere-a para “%2$@?” para tratar o valor indefinido como null.
ru: Ссылка на неопределённую переменную «%1$@». Замените её на «%2$@?», чтобы рассматривать неопределённое значение как null.
zh_hans: 指向未定义的变量 “%1$@”。将其改为 “%2$@?” 以将未定义值视为 null

# ExpressionParser.SyntaxError
source: Syntax error
de: Syntaxfehler
ja: 構文エラー
pt_br: Erro de sintaxe
ru: Синтаксическая ошибка
zh_hans: 语法错误

# ExpressionParser.SyntaxErrorExpected
source: Syntax error at index %1$@ of “%2$@”. Expected: %3$@
de: Syntaxfehler bei Index %1$@ von „%2$@“. Erwartet: %3$@
ja: 「%2$@」のインデックス %1$@ で構文エラーが発生しました。期待される内容: %3$@
pt_br: Erro de sintaxe no índice %1$@ de “%2$@”. Esperado: %3$@
ru: Синтаксическая ошибка в позиции %1$@ строки «%2$@». Ожидается: %3$@
zh_hans: “%2$@”中索引 %1$@ 处的语法错误。期望的是：%3$@

# ExpressionParser.SyntaxErrorExpectedOneOf
source: Syntax error at index %1$@ of “%2$@”. Expected one of: %3$@
de: Syntaxfehler bei Index %1$@ von „%2$@“. Erwartet eines von: %3$@
ja: 「%2$@」のインデックス %1$@ で構文エラーが発生しました。次のいずれかが必要です: %3$@
pt_br: Erro de sintaxe no índice %1$@ de “%2$@”. Esperado um destes: %3$@
ru: Синтаксическая ошибка в позиции %1$@ строки «%2$@». Ожидается одно из: %3$@
zh_hans: “%2$@”中索引 %1$@ 处的语法错误。期望的是：%3$@

# ExpressionParser.VariableNotArray
source: Variable “%1$@” is of type %2$@, not array
de: Variable „%1$@“ ist vom Typ %2$@, kein Array
ja: 変数「%1$@」の型は %2$@ で、配列ではありません
pt_br: A variável “%1$@” é do tipo %2$@, não array
ru: Переменная «%1$@» имеет тип %2$@, а не массив
zh_hans: 变量“%1$@”的类型为 %2$@，而非数组

# FileAttachmentSubpartView.RevealInFinder
source: Reveal in Finder
de: In Finder anzeigen
ja: Finderで表示
pt_br: Mostrar no Finder
ru: Показать в Finder
zh_hans: 在访达中显示

# FileTransfer.AuthenticateTitle
source: Authenticate %@
de: %@ authentifizieren
ja: %@を認証
pt_br: Autenticar %@
ru: Аутентификация %@
zh_hans: 验证 %@

# FileTransfer.AuthPrompt
source: Please enter the %1$@ for %2$@ to begin %3$@.
de: Bitte geben Sie %1$@ für %2$@ ein, um %3$@ zu starten.
ja: %3$@を開始するには、%2$@の%1$@を入力してください。
pt_br: Digite %1$@ para %2$@ para começar %3$@.
ru: Введите %1$@ для %2$@, чтобы начать %3$@.
zh_hans: 请输入 %2$@ 的 %1$@ 以开始 %3$@。

# FileTransfer.GetInfo
source: Get Info
de: Informationen
ja: 情報を見る
pt_br: Obter informações
ru: Получить информацию
zh_hans: 显示简介

# FileTransfer.PasswordManager
source: Password Manager…
de: Passwort-Manager…
ja: パスワードマネージャー…
pt_br: Cofre de senhas…
ru: Менеджер паролей…
zh_hans: 密码管理器…

# FileTransfer.RemoveFromList
source: Remove from List
de: Aus Liste entfernen
ja: リストから削除
pt_br: Remover da lista
ru: Удалить из списка
zh_hans: 从列表中移除

# FileTransfer.ShowInFinder
source: Show in Finder
de: In Finder anzeigen
ja: Finderで表示
pt_br: Mostrar no Finder
ru: Показать в Finder
zh_hans: 在访达中显示

# FileTransfer.Stop
source: Stop
de: Stopp
ja: 停止
pt_br: Parar
ru: Остановить
zh_hans: 停止

# FileTransfer.TransferCancelled
source: Transfer cancelled
de: Übertragung abgebrochen
ja: 転送がキャンセルされました
pt_br: Transferência cancelada
ru: Передача отменена
zh_hans: 传输已取消

# FileTransfer.UnknownError
source: File transfer failed with an unknown error
de: Dateiübertragung ist mit einem unbekannten Fehler fehlgeschlagen
ja: 不明なエラーによりファイル転送が失敗しました
pt_br: A transferência de arquivo falhou com um erro desconhecido
ru: Передача файла завершилась с неизвестной ошибкой
zh_hans: 文件传输因未知错误失败

# General.Add
source: Add
de: Hinzufügen
ja: 追加
pt_br: Adicionar
ru: Добавить
zh_hans: 添加

# General.Cancel
source: Cancel
de: Abbrechen
ja: キャンセル
pt_br: Cancelar
ru: Отмена
zh_hans: 取消

# General.Close
source: Close
de: Schließen
ja: 閉じる
pt_br: Fechar
ru: Закрыть
zh_hans: 关闭

# General.Continue
source: Continue
de: Fortfahren
ja: 続ける
pt_br: Continuar
ru: Продолжить
zh_hans: 继续

# General.Copy
source: Copy
de: Kopieren
ja: コピー
pt_br: Copiar
ru: Копировать
zh_hans: 拷贝

# General.Delete
source: Delete
de: Löschen
ja: 削除
pt_br: Apagar
ru: Удалить
zh_hans: 删除

# General.Done
source: Done
de: Fertig
ja: 完了
pt_br: Concluído
ru: Готово
zh_hans: 完成

# General.Edit
source: Edit
de: Bearbeiten
ja: 編集
pt_br: Editar
ru: Изменить
zh_hans: 编辑

# General.Error
source: Error
de: Fehler
ja: エラー
pt_br: Erro
ru: Ошибка
zh_hans: 错误

# General.MoreInfo
source: More Info
de: Weitere Informationen
ja: 詳細情報
pt_br: Mais informações
ru: Подробнее
zh_hans: 更多信息

# General.No
source: No
de: Nein
ja: いいえ
pt_br: Não
ru: Нет
zh_hans: 否

# General.Open
source: Open
de: Öffnen
ja: 開く
pt_br: Abrir
ru: Открыть
zh_hans: 打开

# General.Paste
source: Paste
de: Einfügen
ja: ペースト
pt_br: Colar
ru: Вставить
zh_hans: 粘贴内容

# General.Remove
source: Remove
de: Entfernen
ja: 削除
pt_br: Remover
ru: Убрать
zh_hans: 移除

# General.Save
source: Save
de: Sichern
ja: 保存
pt_br: Salvar
ru: Сохранить
zh_hans: 存储

# General.SelectAll
source: Select All
de: Alle auswählen
ja: すべてを選択
pt_br: Selecionar tudo
ru: Выделить все
zh_hans: 全选

# General.Yes
source: Yes
de: Ja
ja: はい
pt_br: Sim
ru: Да
zh_hans: 是

# GeneralPrefs.AdvancedGPUSettings
source: Advanced GPU settings
de: Erweiterte GPU-Einstellungen
ja: GPU の詳細設定
pt_br: Ajustes avançados de GPU
ru: Расширенные настройки GPU
zh_hans: 高级 GPU 设置

# GeneralPrefs.AITimeout
source: AI timeout
de: KI-Zeitlimit
ja: AI タイムアウト
pt_br: Tempo limite da IA
ru: Тайм-аут ИИ
zh_hans: AI 超时

# GeneralPrefs.AlwaysOpenAutoLaunch
source: The presence of auto-launch scripts disables opening a window at startup.
de: Das Vorhandensein von Autostart-Skripten deaktiviert das Öffnen eines Fensters beim Start.
ja: 自動起動スクリプトが存在するため、起動時にウインドウを開く設定は無効になっています。
pt_br: A presença de scripts de execução automática desativa a abertura de uma janela na inicialização.
ru: Наличие скриптов автозапуска отключает открытие окна при запуске.
zh_hans: 自动启动脚本的存在会阻止启动时打开窗口。

# GeneralPrefs.AlwaysOpenBuried
source: The existence of buried sessions disables opening a window at startup.
de: Das Vorhandensein von verborgenen Sitzungen deaktiviert das Öffnen eines Fensters beim Start.
ja: 隠しセッションが存在するため、起動時にウインドウを開く設定は無効になっています。
pt_br: A existência de sessões ocultas desativa a abertura de uma janela na inicialização.
ru: Наличие скрытых сеансов отключает открытие окна при запуске.
zh_hans: 隐藏会话的存在会阻止启动时打开窗口。

# GeneralPrefs.AlwaysOpenHotkey
source: The existence of hotkey windows disables opening a window at startup.
de: Das Vorhandensein von Hotkey-Fenstern deaktiviert das Öffnen eines Fensters beim Start.
ja: ホットキーウインドウが存在するため、起動時にウインドウを開く設定は無効になっています。
pt_br: A existência de janelas de hotkey desativa a abertura de uma janela na inicialização.
ru: Наличие окон по горячей клавише отключает открытие окна при запуске.
zh_hans: 热键窗口的存在会阻止在启动时打开窗口。

# GeneralPrefs.APIAuthMethod
source: Authentication method for Python API
de: Authentifizierungsmethode für die Python-API
ja: Python API の認証方法
pt_br: Método de autenticação para a Python API
ru: Метод аутентификации для Python API
zh_hans: Python API 的验证方法

# GeneralPrefs.APIKeyPlaceholder
source: %@ API key
de: %@ API-Schlüssel
ja: %@ の API キー
pt_br: Chave de API do %@
ru: Ключ API %@
zh_hans: %@ API 密钥

# GeneralPrefs.CheckingPluginStatus
source: Checking plugin status…
de: Plugin-Status wird überprüft…
ja: プラグインの状態を確認しています…
pt_br: Verificando o status do plugin…
ru: Проверка состояния плагина…
zh_hans: 正在检查插件状态…

# GeneralPrefs.CopyLocalSettingsPrompt
source: Copy local settings to custom folder now?
de: Lokale Einstellungen jetzt in den benutzerdefinierten Ordner kopieren?
ja: ローカル設定をカスタムフォルダに今すぐコピーしますか？
pt_br: Copiar os ajustes locais para a pasta personalizada agora?
ru: Скопировать локальные настройки в пользовательскую папку сейчас?
zh_hans: 立即将本地设置拷贝到自定义文件夹？

# GeneralPrefs.CustomScriptsFolder
source: Custom folder for Python API scripts
de: Benutzerdefinierter Ordner für Python-API-Skripte
ja: Python API スクリプト用のカスタムフォルダ
pt_br: Pasta personalizada para scripts da Python API
ru: Пользовательская папка для скриптов Python API
zh_hans: Python API 脚本的自定义文件夹

# GeneralPrefs.DefaultModelForNewChats
source: Default model for new AI chats
de: Standardmodell für neue KI-Chats
ja: 新しい AI チャットのデフォルトモデル
pt_br: Modelo padrão para novos chats de IA
ru: Модель по умолчанию для новых чатов с ИИ
zh_hans: 新 AI 聊天的默认模型

# GeneralPrefs.DefaultModelManualTitle
source: Manual: %1$@ — %2$@
de: Manuell: %1$@ – %2$@
ja: 手動: %1$@（%2$@）
ru: Вручную: %1$@ - %2$@
zh_hans: 手动操作：%1$@ — %2$@

# GeneralPrefs.DontCopy
source: Don’t Copy
de: Nicht kopieren
ja: コピーしない
pt_br: Não copiar
ru: Не копировать
zh_hans: 不拷贝

# GeneralPrefs.InstallAIPlugin
source: Install AI Plugin
de: KI-Plugin installieren
ja: AI プラグインをインストール
pt_br: Instalar plugin de IA
ru: Установить плагин ИИ
zh_hans: 安装 AI 插件

# GeneralPrefs.InstallEllipsis
source: Install…
de: Installieren…
ja: インストール…
pt_br: Instalar…
ru: Установить…
zh_hans: 安装…

# GeneralPrefs.InstantReplayMemoryLimit
source: Instant Replay memory usage limit
de: Speichernutzungslimit für Instant Replay
ja: インスタントリプレイのメモリ使用量の上限
pt_br: Limite de uso de memória do Instant Replay
ru: Ограничение использования памяти для Мгновенного повтора
zh_hans: 即时回放内存使用上限

# GeneralPrefs.KeysStoredInKeychain
source: Keys are stored securely in the macOS Keychain.
de: Schlüssel werden sicher im macOS-Schlüsselbund gespeichert.
ja: キーは macOS キーチェーンに安全に保存されます。
pt_br: As chaves são armazenadas com segurança na Keychain do macOS.
ru: Ключи надежно хранятся в Связке ключей macOS.
zh_hans: 密钥安全存储在 macOS 钥匙串中。

# GeneralPrefs.LegacyHeadersText
source: Your AI custom HTTP headers used to be a single global setting. They still apply to your current model, but adding or editing models here does not carry them over. Re-add the headers you need in each model’s “Custom headers” section.
de: Ihre benutzerdefinierten HTTP-Header für KI waren früher eine einzige globale Einstellung. Sie gelten weiterhin für Ihr aktuelles Modell, werden aber beim Hinzufügen oder Bearbeiten von Modellen hier nicht übernommen. Fügen Sie die benötigten Header im Abschnitt „Benutzerdefinierte Header“ jedes Modells erneut hinzu.
ja: 以前は、AI 用のカスタム HTTP ヘッダーは1つのグローバル設定でした。現在のモデルには引き続き適用されますが、ここでモデルを追加または編集してもヘッダーは引き継がれません。必要なヘッダーは、各モデルの「カスタムヘッダー」セクションで再度追加してください。
pt_br: Seus cabeçalhos HTTP personalizados de IA costumavam ser um único ajuste global. Eles ainda se aplicam ao seu modelo atual, mas adicionar ou editar modelos aqui não os transfere. Adicione novamente os cabeçalhos de que precisa na seção “Custom headers” de cada modelo.
ru: Ваши пользовательские HTTP-заголовки ИИ раньше были единой глобальной настройкой. Они по-прежнему применяются к текущей модели, но при добавлении или редактировании моделей здесь они не переносятся. Добавьте нужные заголовки заново в разделе «Пользовательские заголовки» каждой модели.
zh_hans: 您使用的 AI 自定义 HTTP 头曾是单一的全局设置。它们仍然适用于当前模型，但在此处添加或编辑模型不会将其继承。请在每个模型的“自定义头”部分重新添加所需的头。

# GeneralPrefs.LegacyHeadersTitle
source: Custom Headers Are Now Set Per Model
de: Benutzerdefinierte Header werden jetzt pro Modell festgelegt
ja: カスタムヘッダーはモデルごとに設定するようになりました
pt_br: Os cabeçalhos personalizados agora são definidos por modelo
ru: Теперь пользовательские заголовки задаются для каждой модели
zh_hans: 自定义头现在按模型设置
